//length is 455
var data = {
 "V1": [ 180, 160, 150, 150, 150, 150, 145, 145, 145, 140, 140, 135, 135, 130, 130, 130, 130, 130, 130, 128, 127, 126, 125, 125, 125, 123, 122, 121, 121, 120, 120, 120, 120, 120, 118, 116, 116, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 114, 113, 112, 112, 112, 111, 111, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 109, 109, 108, 108, 108, 108, 108, 108, 106, 106, 105, 105, 105, 105, 105, 105, 105, 105, 105, 105, 105, 104, 104, 103, 102, 102, 101, 101, 101, 101, 101, 101, 101, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 99, 99, 99, 99, 98, 98, 98, 97, 97, 97, 97, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 95, 93, 93, 92, 92, 92, 91, 91, 91, 91, 91, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 89, 88, 87, 86, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 84, 84, 83, 81, 81, 81, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 79, 78, 78, 78, 78, 77, 77, 76, 76, 75, 75, 75, 75, 75, 75, 75, 75, 75, 75, 75, 75, 74, 73, 72, 71, 71, 71, 71, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 69, 68, 68, 68, 68, 67, 67, 66, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 64, 61, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 59, 58, 58, 58, 58, 58, 56, 56, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 54, 52, 52, 51, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 48, 48, 48, 47, 46, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 44, 43, 40, 40, 40, 40, 40, 40, 40, 40, 40, 39, 36, 35, 35, 35, 33, 33, 32, 32, 32, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 29, 29, 28, 25, 25, 20, 20, 20, 20, 20, 10, 5 ],
"V2": [ "デオキシスS", "テッカニン", "デオキシスN", "デオキシスA", "メガフーディン", "メガプテラ", "アギルダー", "メガジュカイン", "メガスピアー", "マルマイン", "メガミュウツーY", "メガライボルト", "メガミミロップ", "サンダース", "プテラ", "ミュウツー", "クロバット", "メガゲンガー", "メガミュウツーX", "メロエッタS", "シェイミS", "ファイアロー", "オオスバメ", "マニューラ", "ダークライ", "オンバーン", "ゲッコウガ", "トルネロス(霊獣)", "メガピジョット", "ダグトリオ", "フーディン", "ジュカイン", "アルセウス", "メガボーマンダ", "ルチャブル", "ゼブライカ", "エルフーン", "ペルシアン", "スターミー", "ライコウ", "フローゼル", "エテボース", "アグノム", "チラチーノ", "メガヘルガー", "メガアブソル", "メガレックウザ", "ココロモリ", "ジャローダ", "ブニャット", "ペンドラー", "メガルカリオ", "トルネロス(化身)", "ボルトロス(化身)", "ライチュウ", "ゲンガー", "ケンタロス", "ワタッコ", "エーフィ", "ルギア", "ラティアス", "ラティオス", "ユキメノコ", "アーケオス", "メガエルレイド", "メガディアンシー", "メガメタグロス", "アイアント", "エレザード", "ゴウカザル", "デンチュラ", "コバルオン", "テラキオン", "ビリジオン", "ケルディオ", "レパルダス", "カエンジシ", "ギャロップ", "ストライク", "エレブー", "ライボルト", "ミミロップ", "ムウマージ", "ゾロアーク", "フリージオ", "コジョンド", "メガカイロス", "メガサメハダー", "マフォクシー", "ニャオニクス", "エモンガ", "ガブリアス", "トリミアン", "ピジョット", "ヤナッキー", "バオッキー", "ヒヤッキー", "ランドロス(化身)", "ボルトロス(霊獣)", "デデンネ", "リザードン", "オニドリル", "キュウコン", "ドククラゲ", "ドードリオ", "サンダー", "ミュウ", "バクフーン", "ミルタンク", "エンテイ", "セレビィ", "マッスグマ", "ケッキング", "フライゴン", "ボーマンダ", "ジラーチ", "ムクホーク", "パルキア", "レジギガス", "マナフィ", "シェイミL", "ビクティニ", "ウルガモス", "メガリザードンX", "メガリザードンY", "メガガルーラ", "メガバシャーモ", "メガサーナイト", "メガチャーレム", "メガオニゴーリ", "ゲノセクト", "パンプジン（小）", "ゼルネアス", "イベルタル", "バスラオ", "スワンナ", "サザンドラ", "ラッタ", "ラブカス", "シンボラー", "オノノクス", "オコリザル", "ウインディ", "ルージュラ", "ネイティオ", "ヘルガー", "プラスル", "マイナン", "サメハダー", "レックウザ", "パチリス", "ドラピオン", "エレキブル", "メガヤンマ", "リーフィア", "グライオン", "ユクシー", "ヒヒダルマN", "メブキジカ", "キュレム", "ジガルデ", "ケンホロウ", "ブーバー", "ハハコモリ", "ワルビアル", "メガガブリアス", "ペラップ", "ネオラント", "ロトムN", "ヤミカラス", "ランドロス(霊獣)", "ピカチュウ", "モルフォン", "ガルーラ", "バリヤード", "ファイヤー", "オオタチ", "ホウオウ", "ヤルキモノ", "ザングース", "カイオーガ", "グラードン", "デオキシスD", "ロズレイド", "ルカリオ", "ポリゴンＺ", "ディアルガ", "ギラティナA", "ギラティナO", "ドレディア", "ギギギアル", "レシラム", "ゼクロム", "メロエッタ", "ビビヨン", "ドリュウズ", "サワムラー", "ロトムFC", "ニドキング", "ゴルダック", "カイロス", "フリーザー", "レディアン", "キリンリキ", "ハリーセン", "ヘラクロス", "キングドラ", "オドシシ", "スイクン", "バルビート", "イルミーゼ", "チェリム", "ドクロッグ", "クレセリア", "ダゲキ", "スカタンク", "パンプジン（中）", "ブーバーン", "ギャラドス", "ミロカロス", "メガギャラドス", "フシギバナ", "アーボック", "カブトプス", "カイリュー", "メガニウム", "バシャーモ", "ダーテング", "サーナイト", "チャーレム", "ブーピッグ", "チルタリス", "オニゴーリ", "フワライド", "トゲキッス", "マンムー", "エルレイド", "エムリット", "フィオネ", "ムーランド", "シャンデラ", "ウォーグル", "バルジーナ", "ヌメルゴン", "メガフシギバナ", "メガチルタリス", "バイバニラ", "カメックス", "オーダイル", "ホルード", "メガカメックス", "ヒードラン", "ミルホッグ", "ニドクイン", "エビワラー", "スピアー", "キングラー", "デリバード", "ドーブル", "ネンドール", "アブソル", "ダストダス", "フラージェス", "クレッフィ", "メガハッサム", "メガヘラクロス", "メガジュペッタ", "ガマゲロゲ", "カラマネロ", "ペロリーム", "ビーダル", "ドンカラス", "ガチゴラス", "メガバンギラス", "バタフリー", "ニョロボン", "ウツボット", "ジュゴン", "パルシェン", "ヨルノズク", "ニョロトノ", "マンタイン", "エアームド", "カポエラー", "グラエナ", "ルンパッパ", "キノガッサ", "エネコロロ", "ルナトーン", "ソルロック", "ポワルン", "メタグロス", "レントラー", "ダイケンキ", "キリキザン", "レアコイル", "メガラグラージ", "パンプジン（大）", "アズマオウ", "バクオング", "ゴーゴート", "ガメノデス", "スリーパー", "ランターン", "ガーメイル", "サンドパン", "シャワーズ", "ブースター", "ブラッキー", "ハッサム", "アゲハント", "ドクケイル", "ペリッパー", "ハブネーク", "ジュペッタ", "チリーン", "トドゼルガ", "コロトック", "グレイシア", "エンブオー", "ゴチルゼル", "ママンボウ", "クイタラン", "ブリガロン", "バンギラス", "ピクシー", "カモネギ", "マタドガス", "ラプラス", "ポリゴン２", "ラグラージ", "アメモース", "ホエルオー", "パッチール", "ナマズン", "エンペルト", "ユキノオー", "ジバコイル", "マラカッチ", "ブルンゲル", "ギルガルド", "ニンフィア", "ブロスター", "ラムパルド", "ズルズキン", "ジヘッド", "ゴロンダ", "アマルルガ", "ドダイトス", "オーロット", "カイリキー", "ナッシー", "イーブイ", "オムスター", "デンリュウ", "リングマ", "ハピナス", "マルノーム", "ノクタス", "シザリガー", "ジーランス", "ヒヒダルマD", "ゴルーグ", "バッフロン", "パンプジン（特大）", "ハンテール", "サクラビス", "トロピウス", "ラフレシア", "ベトベトン", "キレイハナ", "マリルリ", "ドンファン", "ハリテヤマ", "ヤミラミ", "クチート", "ボスゴドラ", "レジロック", "レジスチル", "レジアイス", "ベロベルト", "モジャンボ", "タブンネ", "シビルドン", "ツンベアー", "ラッキー", "メレシー", "メガクチート", "メガボスゴドラ", "メガタブンネ", "メタモン", "アンノーン", "クリムガン", "カバルドン", "マスキッパ", "プクリン", "ゴローニャ", "ガラガラ", "ノコッチ", "グランブル", "オクタン", "アーマルド", "ヨノワール", "ローブシン", "ナゲキ", "イワパレス", "メガデンリュウ", "ドラミドロ", "ユレイドル", "アリアドス", "フォレトス", "ヌケニン", "バクーダ", "カクレオン", "ビークイン", "ドサイドン", "ダイノーズ", "オーベム", "トリトドン", "ミノマダム", "ヌオー", "サニーゴ", "ミカルゲ", "ソーナンス", "ドータクン", "パールル", "アバゴーラ", "マッギョ", "パラセクト", "ヤドラン", "カビゴン", "ウソッキー", "キマワリ", "ヤドキング", "ハガネール", "マグカルゴ", "トリデプス", "デスカーン", "ランクルス", "モロバレル", "メガユキノオー", "メガヤドラン", "メガハガネール", "ムシャーナ", "フレフワン", "クレベース", "サマヨール", "ギガイアス", "コータス", "シュバルゴ", "ナットレイ", "メガヤミラミ", "メガバクーダ", "ナックラー", "ツボツボ" ]
}

var x1;
var x2;
var x3;
var x4;
var x5;

//Create the audio tag
var corr = document.createElement("audio");
corr.preload = "auto";
var wrong = document.createElement("audio");
wrong.preload = "auto";

//Load the sound file (using a source element for expandability)
var src = document.createElement("source");
src.src = "/static/sounds/correct.mp3";
var src2 = document.createElement("source");
src2.src = "/static/sounds/wrong.mp3";

corr.appendChild(src);
wrong.appendChild(src2);

//Load the audio tag
//It auto plays as a fallback
corr.load();
corr.volume = 0.000000;
corr.play();

wrong.load();
wrong.volume = 0.000000;
wrong.play();

//Plays the sound
function play(sound) {
   //Set the current time for the audio file to the beginning
   sound.currentTime = 0.01;
   sound.volume = 1;

   //Due to a bug in Firefox, the audio needs to be played after a delay
   setTimeout(function(){sound.play();},1);
}


var choose = function () {
	return Math.floor(Math.random() * 455);
}

window.onload = function() {
	x1 = choose();
	x2 = choose();
	x3 = choose();
	x4 = choose();
	x5 = choose();
	document.getElementById("pok1").innerHTML = data["V2"][x1];
	document.getElementById("pok2").innerHTML = data["V2"][x2];
	document.getElementById("pok3").innerHTML = data["V2"][x3];
	document.getElementById("pok4").innerHTML = data["V2"][x4];
	document.getElementById("pok5").innerHTML = data["V2"][x5];
}

function checkSols() {
	var num1 = parseInt(document.getElementById("a").value);
	var num2 = parseInt(document.getElementById("b").value);
	var num3 = parseInt(document.getElementById("c").value);
	var num4 = parseInt(document.getElementById("d").value);
	var num5 = parseInt(document.getElementById("e").value);
	var correct = true;
	var guesses = [num1, num2, num3, num4, num5];
	var sol = [x1, x2, x3, x4, x5];

	var e = document.getElementById("moder");
	var mode = e.options[e.selectedIndex].value;

	if (mode == 1) {
		for (var i = 1; i < 5; i++) {
			var keep = guesses.indexOf(i);
			var keep2 = guesses.indexOf(i + 1);
			if (keep === -1 || keep2 === -1 || data['V1'][sol[keep]] < data['V1'][sol[keep2]]) {
				correct = false;
				break;
			}
		}
	} else {
		for (var i = 0; i < 5; i++) {
			if (guesses[i] != data["V1"][sol[i]]) {
				correct = false;
				break;
			}
		}
	}

	if (correct) {
		document.getElementById("img").style.display = "block";
		if (document.getElementById("sound").checked == true) {
			play(corr);
		}
	} else {
		document.getElementById("img").style.display = "none";
	}
}

function answer() {
	alert(data['V2'][x1] + ": " + data['V1'][x1] + "\n" +
			data['V2'][x2] + ": " + data['V1'][x2] + "\n" +
			data['V2'][x3] + ": " + data['V1'][x3] + "\n" +
			data['V2'][x4] + ": " + data['V1'][x4] + "\n" +
			data['V2'][x5] + ": " + data['V1'][x5] + "\n"
		);
}

function reset() {
	document.getElementById("img").style.display = "none";
	x1 = choose();
	x2 = choose();
	x3 = choose();
	x4 = choose();
	x5 = choose();
	document.getElementById("pok1").innerHTML = data["V2"][x1];
	document.getElementById("pok2").innerHTML = data["V2"][x2];
	document.getElementById("pok3").innerHTML = data["V2"][x3];
	document.getElementById("pok4").innerHTML = data["V2"][x4];
	document.getElementById("pok5").innerHTML = data["V2"][x5];
	var temp = document.getElementsByClassName("inputs");
	for(var i = 0; i < temp.length; i++) {
	    temp[i].value = '';
	}
	//resets the list of pokemon
}